20231128T130604--emacs-setup-on-digitalocean-with-dropbox__cloud_emacs.org
#+title:      emacs setup on digitalocean with dropbox
#+date:       [2023-11-28 Tue 13:06]
#+filetags:   :cloud:emacs:
#+identifier: 20231128T130604

* Emacs setup on digitalocean

psx - lAba$!1o
simply using password, ssh is acting up with me

[[https://www.youtube.com/watch?v=98YuVDj6g8Q&ab_channel=RibaLinux][install GUI]]
[[https://www.youtube.com/watch?v=r3t61OP5mWs&ab_channel=TonyTeachesTech][how to conenct to ssh into digitaloacean]]
[[https://www.digitalocean.com/community/questions/dropbox-works-with-digitalocean-droplets][dropbox on digital ocean droplet vm]]

** launch dropbox

- little tut [[https://www.dropbox.com/install-linux][install headless dropbox]]
- [[https://www.dropbox.com/install-linux][use this link to download dropbox]]
- then click on the link in command line to to link to your dropbox.
  Paste link in the browser
- download python3
- download the python script
- python3 dropbox.py status - runs, good
- [[https://www.youtube.com/watch?v=mA08E59-zo8&ab_channel=ChrisTitusTech][create a symlink to this python script]]
  - echo $PATH
  - go to /usr/local/bin
  - create a symlink with FULL PATHNAME ln -s ~/scripts/dropbox.py
  - sudo chmod 744 dropbox.py - make the script executable!
  - try to do dropbox.py in the current folder
  - try to do it in other folders
  - python3 dropbox.py status
