html/20231128T130604--emacs-setup-on-digitalocean-with-dropbox__cloud_emacs.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://arvydasg.github.io/devnotes/html/rss.xml"
      title="RSS feed for https://arvydasg.github.io/devnotes/html">
<title>emacs setup on digitalocean with dropbox</title>
<meta name="author" content="Arvydas Gasparavicius">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
<link rel="stylesheet" href="../static/style.css"/>
<link rel="icon" href="../static/ag.ico">
</head>
<body>
<div id="preamble" class="status"><br>preamble here yo</br></div>
<div id="content">
<div class="post-date">14 Dec 2023</div><h1 class="post-title"><a href="https://arvydasg.github.io/devnotes/html/20231128T130604--emacs-setup-on-digitalocean-with-dropbox__cloud_emacs.html">emacs setup on digitalocean with dropbox</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8958ae1">1. Emacs setup on digitalocean</a>
<ul>
<li><a href="#orgf175e1f">1.1. launch dropbox</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-org8958ae1" class="outline-2">
<h2 id="org8958ae1"><span class="section-number-2">1.</span> Emacs setup on digitalocean</h2>
<div class="outline-text-2" id="text-1">
<p>
psx - lAba$!1o
simply using password, ssh is acting up with me
</p>

<p>
<a href="https://www.youtube.com/watch?v=98YuVDj6g8Q&amp;ab_channel=RibaLinux">install GUI</a>
<a href="https://www.youtube.com/watch?v=r3t61OP5mWs&amp;ab_channel=TonyTeachesTech">how to conenct to ssh into digitaloacean</a>
<a href="https://www.digitalocean.com/community/questions/dropbox-works-with-digitalocean-droplets">dropbox on digital ocean droplet vm</a>
</p>
</div>

<div id="outline-container-orgf175e1f" class="outline-3">
<h3 id="orgf175e1f"><span class="section-number-3">1.1.</span> launch dropbox</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>little tut <a href="https://www.dropbox.com/install-linux">install headless dropbox</a></li>
<li><a href="https://www.dropbox.com/install-linux">use this link to download dropbox</a></li>
<li>then click on the link in command line to to link to your dropbox.
Paste link in the browser</li>
<li>download python3</li>
<li>download the python script</li>
<li>python3 dropbox.py status - runs, good</li>
<li><a href="https://www.youtube.com/watch?v=mA08E59-zo8&amp;ab_channel=ChrisTitusTech">create a symlink to this python script</a>
<ul class="org-ul">
<li>echo $PATH</li>
<li>go to /usr/local/bin</li>
<li>create a symlink with FULL PATHNAME ln -s ~/scripts/dropbox.py</li>
<li>sudo chmod 744 dropbox.py - make the script executable!</li>
<li>try to do dropbox.py in the current folder</li>
<li>try to do it in other folders</li>
<li>python3 dropbox.py status</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div class="taglist"><a href="https://arvydasg.github.io/devnotes/html/tags.html">Tags</a>: <a href="https://arvydasg.github.io/devnotes/html/tag-cloud.html">cloud</a> <a href="https://arvydasg.github.io/devnotes/html/tag-emacs.html">emacs</a> </div></div>
<div id="postamble" class="status"><br>postamble in he house</br></div>
</body>
</html>
